# IncludeAdditionalLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..IncludeAdditionalLoad Property
ElectricalDemandFactorDefinition Class See Also
---
Should the additional load (if set) be included in demand load calculations.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IncludeAdditionalLoad { get; set; }
```

Visual Basic
---
```text
Public Property IncludeAdditionalLoad As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IncludeAdditionalLoad {
	bool get ();
	void set (bool value);
}
```

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace